const questionsCount = 7;
const options = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'];
const roles = {
    implementer: {
        title: 'اجرایی',
        options: ['1G', '2A', '3H', '4D', '5B', '6F', '7E'],
        attributes: 'منظم، قابل تکیه، محافظه‌کار و کارا. ایده‌ها را تبدیل به عمل می‌کند. دارای عقل عملی است و سخت‌کوش است.',
        weaknesses: 'می‌تواند تا حدی غیر قابل انعطاف باشد و نسبت به امکانات جدید واکنش کندی نشان دهد.',
        encouragers: 'آن‌ها را از پیشنهاد مطلع کنید. جزئیات را روی طرح‌های بزرگتر و تعریف نقش‌ها معین کنید. او را زود تشویق کنید و از او بخواهید که منظم به شما گزارش دهد. تشویق و تقدیر کنید.'
    },
    coordinator: {
        title: 'رئیس/هماهنگ‌کننده',
        options: ['1D', '2B', '3A', '4H', '5F', '6C', '7G'],
        attributes: 'آرام، مطمئن، اهداف را معین می‌کند، تصمیم‌گیری را تسهیل می‌کند و خوب کار نمایندگی گروه را انجام می‌دهد. این ظرفیت را دارد که برحسب شایستگی‌ها رفتاری عادلانه و بدون تعصب از خود نشان دهد و از تمام کمک‌ها استقبال کند.',
        weaknesses: 'از لحاظ توانایی ممکن است از حد متوسط فراتر نرود و نیز گاهی به‌دنبال کارهای شخصی‌اش است.',
        encouragers: 'به موقعیت آن‌ها لطمه نزنید. برحسب نقش‌های شناخته‌شدهٔ موجود به آن‌ها پیشنهاداتی را ارائه دهید. طبق برنامه پیش بروید.'
    },
    shaper: {
        title: 'شکل‌دهنده',
        options: ['1F', '2E', '3C', '4B', '5D', '6G', '7A'],
        attributes: 'چالش‌برانگیز، پویا، تحت فشار سخت تلاش می‌کند. انگیزه و شجاعت لازم را برای فائق آمدن بر موانع را داراست. با بی‌حرکتی و سکون، آدم‌های از خود راضی و خودفریبی مبارزه می‌کند.',
        weaknesses: 'می‌تواند باعث تحریک دیگران شود. نسبت به تأخیر بی‌حوصله است. ممکن است به احساسات دیگران خدشه وارد کند.',
        encouragers: 'برای او اصل پیشنهاد را مطرح کنید. به او فرصت دهید که کنترل کار را در مرحلهٔ طراحی به‌دست گیرد. تضمین کنید که خوب بتواند کار را به چالش بکشاند. از جزئیات پرهیز کنید. از آن‌ها انتظار نداشته باشید که تمام‌کننده باشند.'
    },
    plant: {
        title: 'خلاق و مبتکر',
        options: ['1C', '2G', '3D', '4E', '5H', '6A', '7F'],
        attributes: 'خلاق، مبتکر، ایده‌پرداز، غیر اصول‌گرا. مشکلات سخت را حل می‌کند و ایده‌های تازه را مطرح می‌کند.',
        weaknesses: 'جزئیات را نادیده می‌گیرد. آن‌قدر ذهنش مشغول است که نمی‌تواند ارتباطات مؤثری برقرار کند.',
        encouragers: 'در برخورد با او مشکل را مطرح کنید و نه ایده‌های خودتان را. پیشنهاد خود را به پروژهٔ آن‌ها متصل کنید. پیشنهادات آن‌ها را تشویق کنید.'
    },
    resource_investigator: {
        title: 'جست‌وجوگر منابع',
        options: ['1A', '2C', '3F', '4G', '5E', '6H', '7D'],
        attributes: 'برون‌گرا، با شور و نشاط، کنجکاو، ارتباطی. دارای ظرفیت لازمه برای ارتباطات تازه و چیزهای نو. دارای توانایی برای پاسخگویی به یک چالش.',
        weaknesses: 'وقتی که شور و نشاط اولیه تمام می‌شود، ممکن است علاقه‌اش نسبت به موضوع پایان یابد. می‌تواند بیش از حد خوش‌بین باشد.',
        encouragers: 'از اندیشه‌های آن‌ها استقبال کنید و از آن‌ها بخواهید که شبکهٔ اجتماعی خود را برای پیشبرد این اندیشه‌ها به‌کار گیرند. با آن‌ها بیشتر دربارهٔ اصول و کلیت کار صحبت کنید تا دربارهٔ جزئیات. از آن‌ها توقع نداشته باشید که کار را به پایان برسانند.'
    },
    monitor_evaluator: {
        title: 'ارزیاب ناظر',
        options: ['1H', '2D', '3G', '4C', '5A', '6E', '7B'],
        attributes: 'هوشیار، استراتژیک، با قدرت تشخیص. تمام گزینه‌ها و قضاوت‌ها را به‌درستی در نظر می‌گیرد. بروندادها و اندیشه‌های گروهی را مورد ارزیابی قرار می‌دهد.',
        weaknesses: 'فاقد قدرت الهام‌بخشی یا انگیزه‌بخشی به دیگران است. می‌تواند بیش از اندازه منتقد باشد.',
        encouragers: 'پایشنهادات‌تان را معمولاً با جزئیات فراوان مرحله به مرحله مطرح کنید. از اصول مبهم بپرهیزید. داده‌های زیادی را در اختیار قرار دهید. به آن‌ها امکان دهید که از قدرت قضاوت و داوری خود استفاده کنند.'
    },
    teamworker: {
        title: 'همکار گروه',
        options: ['1B', '2F', '3E', '4A', '5C', '6B', '7H'],
        attributes: 'اهل همکاری، ملایم، دارای توانایی درک شرایط و دیپلماتیک. خوب گوش می‌دهد، اصطکاک را دفع می‌کند، اوضاع را آرام می‌کند و می‌تواند مقوم کار گروهی باشد.',
        weaknesses: 'در لحظات بحرانی توانایی تصمیم‌گیری خود را از دست می‌دهد. به‌راحتی می‌توان او را تحت تأثیر قرار داد.',
        encouragers: 'با او در خصوص رابط فردی و دلایل معنوی کار تأکید کنید و به وضوح به او بگویید که اولویت‌های شما در کوتاه‌مدت چه چیزهایی هستند.'
    },
    finisher: {
        title: 'تمام‌کننده',
        options: ['1E', '2H', '3B', '4F', '5G', '6D', '7C'],
        attributes: 'سخت‌کوش، منظم، خودآگاه، مضطرب. دائم به دنبال خطاهاست. سروقت تحویل می‌دهد. به جزئیات توجه زیادی دارد.',
        weaknesses: 'ممکن است بیش از حد نگران چیزهای کوچک باشد. میل ندارد که نمایندگی کند.',
        encouragers: 'در مورد تمام جزئیات طرح با او شفاف باشید. از ایده‌های بزرگ اجتناب کنید. به‌دنبال پیشنهادات عملی و کوتاه‌مدت باشید. با او در مورد پاسخ‌های ساختاردار و جزئی‌شده توافق کنید.'
    },
};
let options_with_score_10_count = 0;

function getSum(questionNumber) {
    let sum = 0;
    for (const option of options) {
        let score = parseFloat($('#' + questionNumber + option).val()) || 0;
        if (score == 10) {
            options_with_score_10_count++;
        }
        sum += score;
    }
    return parseFloat(sum);
}

function updateQuestionRemainingScore(questionNumber) {
    $('#score-sum-' + questionNumber).html(getSum(questionNumber));
}

for (let i = 1; i <= questionsCount; i++) {
    for (const option of options) {
        $('#' + i + option).bind('change paste keyup', function () {
            updateQuestionRemainingScore(i);
        });
    }
}

$('form').submit(function (e) {
    e.preventDefault();
    let errorsHtml = '';
    options_with_score_10_count = 0;
    for (let i = 1; i <= questionsCount; i++) {
        const sum = getSum(i);
        if (sum != 10) {
            errorsHtml += '<li>مجموع امتیازات سؤال ' + i + ' برابر با ' + sum + ' است، اما باید برابر با 10 باشد.</li>';
        }
    }
    if (options_with_score_10_count > 3) {
        errorsHtml += '<li>تعداد گزینه‌های با امتیاز 10 نباید بیشتر از 3 شود. این عدد در حال حاضر ' + options_with_score_10_count + ' است.</li>';
    }
    $('#errors').html(errorsHtml);
    if (errorsHtml) {
        $('#results_section').hide();
        $('#errors').show();
        return;
    }
    $('#errros').hide();
    let roleScores = [];
    for (let [key, value] of Object.entries(roles)) {
        let score = 0;
        for (let optionId of value.options) {
            score += parseFloat($('#' + optionId).val()) || 0;
        }
        roleScores.push([key, score]);
    }
    roleScores.sort((a, b) => b[1] - a[1]);
    let rolesHtml = '';
    for (roleScore of roleScores) {
        let role = roles[roleScore[0]];
        rolesHtml += `<h4>` + role.title + ` - امتیاز: ` + roleScore[1] + `</h4>
          <ul>
            <li><b>ویژگی‌ها:</b> ` + role.attributes + `</li>
            <li><b>نقاط ضعف قابل تحمل:</b> ` + role.weaknesses + `</li>
            <li><b>مشوق‌ها:</b> ` + role.encouragers + `</li>
          </ul>`;
    }
    $('#results').html(rolesHtml);
    $('#results_section').show();
});
